{
  "backend/main.mo": "Defines core social-network data types and initializes maps for posts, profiles, friendships, requests, notifications, and storage with authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components and pages for routing, profiles, feed, requests, and UI elements.",
  "frontend/DEPLOYMENT.md": "Deployment instructions outlining prerequisites and build steps for publishing the app.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes wrapped in AppShell and AuthGate for feed, profiles, directory, requests, notifications, and settings.",
  "frontend/src/components/AppHeader.tsx": "Header component with authenticated navigation, unread notifications badge, and mobile drawer menu.",
  "frontend/src/components/AppShell.tsx": "Page layout wrapper providing header, main content container, and footer.",
  "frontend/src/components/AuthGate.tsx": "Blocks access to protected pages and displays a sign‑in prompt when unauthenticated.",
  "frontend/src/components/FriendActions.tsx": "Renders friend‑related action buttons based on relationship status with error handling and mutation hooks.",
  "frontend/src/components/FriendRequestCard.tsx": "Renders a friend request card showing user info and actions to accept, decline, or cancel requests with loading states.",
  "frontend/src/components/FriendsList.tsx": "Displays a list of a user's friends, loading profiles and enabling navigation to each friend's profile.",
  "frontend/src/components/ImagePicker.tsx": "Provides image upload with validation, preview, progress tracking, and removal support, returning an ExternalBlob.",
  "frontend/src/components/LoginButton.tsx": "Displays a sign-in/out button using Internet Identity with handling for login state and session clearing.",
  "frontend/src/components/PostComments.tsx": "Shows collapsible post comments, allows adding and deleting comments, and loads commenter profiles.",
  "frontend/src/components/PostComposer.tsx": "Form for creating a post with text and optional image, using ImagePicker and createPost mutation.",
  "frontend/src/components/PostEditDialog.tsx": "Dialog for editing an existing post’s content and media with validation and update handling.",
  "frontend/src/components/PostList.tsx": "Renders a list of posts with author info, media, reactions, comments, and pin handling for profile mode.",
  "frontend/src/components/PostOwnerActions.tsx": "Provides owner-only post controls including edit, delete, and optional pin/unpin with dialogs and mutation hooks.",
  "frontend/src/components/PostReactions.tsx": "Displays reaction count and lets authenticated users toggle a heart reaction using backend mutation hooks.",
  "frontend/src/components/ProfileEditor.tsx": "Form for editing user profile details, images, and saving updates via mutation hook.",
  "frontend/src/components/ProfileFollowButton.tsx": "Renders follow/unfollow button for another user with loading states using follow-related hooks.",
  "frontend/src/components/ProfileImages.tsx": "Shows cover and avatar images with fallbacks and size variants for user profiles.",
  "frontend/src/components/UserCard.tsx": "User directory card displaying profile info with navigation, follow controls, and validity checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useComments.ts": "Provides hooks to fetch, add, and delete comments with query invalidation for updates.",
  "frontend/src/hooks/useDiscoverSignals.ts": "Offers fire-and-forget functions to record search and profile view signals without impacting UI.",
  "frontend/src/hooks/useFollow.ts": "Provides hooks for checking follow status, following/unfollowing users, and retrieving the list of followed principals via react-query.",
  "frontend/src/hooks/useFollowStats.ts": "Fetches follow statistics for a given user with default placeholder values on error.",
  "frontend/src/hooks/useFriends.ts": "Implements hooks to fetch friends, check friendship status, and manage friend request actions using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines context and provider for Internet Identity authentication, exposing identity state and login/logout methods.",
  "frontend/src/hooks/useNotifications.ts": "Contains hooks to fetch, count, and mark notifications as read for the current user.",
  "frontend/src/hooks/usePosts.ts": "Provides hooks to fetch user posts and perform create, update, delete, and pin post mutations.",
  "frontend/src/hooks/useProfiles.ts": "Supplies hooks for fetching and saving user profiles, including the caller’s profile.",
  "frontend/src/hooks/useReactions.ts": "Offers hooks to fetch post reactions and toggle the caller’s reaction.",
  "frontend/src/hooks/useSettings.ts": "Includes hooks to fetch and save user settings, invalidating related profile data on updates.",
  "frontend/src/hooks/useTimeline.ts": "Fetches the caller’s timeline posts from the backend.",
  "frontend/src/hooks/useUserSearch.ts": "Searches user profiles based on trimmed search text using react-query.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with QueryClient and InternetIdentity providers, and loads global styles.",
  "frontend/src/pages/FeedPage.tsx": "Displays the feed with post composer and post list, redirecting unauthenticated users to the home page.",
  "frontend/src/pages/FriendRequestsPage.tsx": "Shows incoming and outgoing friend requests with tabs and loading states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page prompting login and highlighting app features, redirecting authenticated users to the feed.",
  "frontend/src/pages/MyProfilePage.tsx": "Renders the current user’s profile, posts, and follow stats, including profile setup and editing flows.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with per-item and bulk mark-as-read actions.",
  "frontend/src/pages/SettingsPage.tsx": "Allows users to update and save their display name in profile settings.",
  "frontend/src/pages/UserDirectoryPage.tsx": "Provides user search and discovery with loading, error handling, and following indicators.",
  "frontend/src/pages/UserProfilePage.tsx": "React page that loads and displays a user's profile, posts, and follow/friendship status, handling invalid IDs and redirects for own profile.",
  "frontend/src/utils/formatDate.ts": "Utility that formats bigint nanosecond timestamps into readable dates using date-fns.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, supporting both query and hash routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, plugins, and content paths.",
  "project_state.json": "Metadata file describing project state, versions, and an in-progress feature request for deployment."
}