{
  "backend/main.mo": "Defines core social network types and in‑memory maps for posts, profiles, friends, requests, reactions, and notifications, including timestamp comparison helpers.",
  "feature_evidence.json": "Feature evidence report describing removal of the 'Find People' navigation item and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files outlining their roles in routing, layout, pages, and UI components.",
  "frontend/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes and global base styles.",
  "frontend/index.html": "Minimal HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and wraps them in AppShell with AuthGate protection.",
  "frontend/src/components/AppHeader.tsx": "Sticky header with authenticated desktop and mobile navigation including feed, requests, notifications, settings, and profile links.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, main content container, and footer attribution.",
  "frontend/src/components/AuthGate.tsx": "Guard component that prompts users to sign in when accessing protected content.",
  "frontend/src/components/FriendActions.tsx": "Renders friend action buttons based on friendship status and triggers friend request mutations with error handling.",
  "frontend/src/components/FriendRequestCard.tsx": "Displays an incoming or outgoing friend request with profile info and actions to accept, decline, or cancel.",
  "frontend/src/components/FriendsList.tsx": "Fetches and displays a user's friends with profile avatars and navigation to each profile.",
  "frontend/src/components/ImagePicker.tsx": "Allows selecting, previewing, validating, and removing an image file, supporting upload progress and size/type checks.",
  "frontend/src/components/LoginButton.tsx": "Provides sign‑in/sign‑out UI using Internet Identity and handles login state and errors.",
  "frontend/src/components/PostComments.tsx": "Loads, displays, adds, and deletes comments on a post with authentication checks and collapsible UI.",
  "frontend/src/components/PostComposer.tsx": "Form for creating a post with text and optional image using an ImagePicker and createPost mutation.",
  "frontend/src/components/PostEditDialog.tsx": "Dialog for editing an existing post’s text and media, using ImagePicker and updatePost mutation with validation.",
  "frontend/src/components/PostList.tsx": "Renders a list of posts with author info, media, reactions, comments, and optional pin handling for profile mode.",
  "frontend/src/components/PostOwnerActions.tsx": "Provides edit, delete, and optional pin/unpin actions for posts owned by the authenticated user.",
  "frontend/src/components/PostReactions.tsx": "Displays reaction count and allows authenticated users to toggle a heart reaction on a post.",
  "frontend/src/components/ProfileEditor.tsx": "Form for editing and saving the caller's profile, including display name, bio, avatar, and cover photo.",
  "frontend/src/components/ProfileImages.tsx": "Displays a user's cover photo and avatar with fallbacks and size presets.",
  "frontend/src/components/UserCard.tsx": "Shows a compact user profile card with avatar, bio, navigation, and follow/unfollow controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication state and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching, adding, and deleting post comments with query cache updates.",
  "frontend/src/hooks/useFollow.ts": "Hooks for checking follow status and performing follow/unfollow actions while updating related caches.",
  "frontend/src/hooks/useFollowStats.ts": "Fetches follower/following stats for a user with safe defaults on error.",
  "frontend/src/hooks/useFriends.ts": "Provides React Query hooks for fetching friends, friendship status, and managing friend request actions via the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an auth provider and hook for managing Internet Identity login, persistence, status, and logout using Dfinity AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Supplies hooks for fetching caller notifications and marking individual or all notifications as read.",
  "frontend/src/hooks/usePosts.ts": "Contains hooks to fetch, create, update, delete, and pin posts while invalidating related query caches.",
  "frontend/src/hooks/useProfiles.ts": "Provides hooks to fetch and save user profiles for the caller or a specified principal.",
  "frontend/src/hooks/useReactions.ts": "Exposes hooks for fetching reactions on posts and toggling the caller’s reaction.",
  "frontend/src/hooks/useSettings.ts": "Adds hooks for retrieving and saving caller-specific user settings.",
  "frontend/src/hooks/useTimeline.ts": "Defines a hook to fetch the caller’s aggregated timeline posts.",
  "frontend/src/hooks/useUserSearch.ts": "Provides a hook for searching user directory profiles by text.",
  "frontend/src/index.css": "Configures Tailwind base styles and design tokens for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FeedPage.tsx": "Renders the authenticated user’s feed with a post composer, loading states, and redirects if unauthenticated.",
  "frontend/src/pages/FriendRequestsPage.tsx": "Displays incoming and outgoing friend requests with loading states and uses FriendRequestCard for each request.",
  "frontend/src/pages/LandingPage.tsx": "Shows a marketing-style landing page with login and feature highlights, redirecting authenticated users to the feed.",
  "frontend/src/pages/MyProfilePage.tsx": "Shows the authenticated user's profile, stats, posts, and profile editor logic with fallbacks for loading/setup states.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with support for marking individual or all notifications as read and displays profile info for senders.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI to update display name and privacy settings with save actions and loading states.",
  "frontend/src/pages/UserDirectoryPage.tsx": "Implements a searchable user directory with tabs, loading states, and rendering UserCard results.",
  "frontend/src/pages/UserProfilePage.tsx": "Page component that loads and displays another user's profile, posts, friendship status, and follow stats, handling invalid IDs and redirects for own profile.",
  "frontend/src/utils/formatDate.ts": "Converts bigint nanosecond timestamps into human‑readable dates using date-fns.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project state metadata describing features, requirements, UI notes, and versioning for the application."
}