{
  "backend/main.mo": "Motoko canister defining media, profiles, posts, friendships, and friend‑request logic with access control and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files used as build documentation input.",
  "frontend/index.css": "Tailwind base file defining light and dark theme CSS variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages with AppShell and AuthGate.",
  "frontend/src/components/AppHeader.tsx": "Top navigation bar showing brand, navigation links, and login/profile controls.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/AuthGate.tsx": "Guard component that blocks access and shows a sign‑in prompt when unauthenticated.",
  "frontend/src/components/FriendActions.tsx": "Conditionally renders friend‑related action buttons based on friendship status and hooks.",
  "frontend/src/components/FriendRequestCard.tsx": "Renders a card for incoming or outgoing friend requests with accept, decline, or cancel actions and profile preview.",
  "frontend/src/components/FriendsList.tsx": "Displays a list of a user's friends with profile lookups and navigation to their profiles.",
  "frontend/src/components/ImagePicker.tsx": "Provides image upload with validation, preview, progress tracking, and removal options.",
  "frontend/src/components/LoginButton.tsx": "Shows a sign‑in/sign‑out button using Internet Identity with login handling and query reset.",
  "frontend/src/components/PostComposer.tsx": "Form for creating posts with text, optional image upload, and submission handling.",
  "frontend/src/components/PostList.tsx": "Renders a list of posts with author info, timestamps, content, and optional media.",
  "frontend/src/components/ProfileEditor.tsx": "Editor form for updating user profile fields and images with save handling.",
  "frontend/src/components/ProfileImages.tsx": "Displays cover and avatar images with size options and fallbacks.",
  "frontend/src/components/UserCard.tsx": "Clickable user card showing avatar, name, bio, and navigating to the user's profile.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useFriends.ts": "React Query hooks for managing friends and friend requests, including fetching friends, checking status, and sending or handling requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for authentication, exposing identity state and login/logout functions.",
  "frontend/src/hooks/usePosts.ts": "Hooks to fetch a user's posts and create new posts, invalidating related post and timeline queries on changes.",
  "frontend/src/hooks/useProfiles.ts": "Hooks for fetching and saving user profiles, including current and arbitrary user profiles using the actor API.",
  "frontend/src/hooks/useTimeline.ts": "Fetches the user's timeline posts via the backend actor.",
  "frontend/src/hooks/useUserSearch.ts": "Provides a placeholder hook returning all user profiles, currently returning an empty list.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes and base styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user's feed using timeline data, redirecting unauthenticated users to the landing page.",
  "frontend/src/pages/FriendRequestsPage.tsx": "Shows incoming and outgoing friend requests with tabs and loading states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering login via Internet Identity and highlighting app features.",
  "frontend/src/pages/MyProfilePage.tsx": "Renders the signed-in user's profile page with profile editing, post creation, and a list of their posts.",
  "frontend/src/pages/UserDirectoryPage.tsx": "Displays a searchable directory of all user profiles with loading states and filtered results.",
  "frontend/src/pages/UserProfilePage.tsx": "Shows another user's profile with posts and friends list, handles invalid IDs, and redirects if viewing own profile.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, supporting hash-based and standard routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugin setup.",
  "project_state.json": "Holds project metadata, feature summaries, requirements mappings, and versioned state information."
}